"""
Варіант 8

Задача №1: 2.	Дано текст в рядку. Виведіть слово, яке в цьому тексті зустрічається найчастіше. Якщо таких слів кілька, виведіть те, яке менше в лексикографічному порядку.
Автор: Гладкович Ярослав
"""

# Просить користувача ввести рядок
text = input("Введіть текст: ")

# Розбиває рядок на слова за допомогою методу split() та зберегти їх у список
words = text.split()

# Створює словник для підрахунку кількості зустрічань кожного слова
word_count = {}

# Перебирає кожне слово в списку та збільшити лічильник для цього слова в словнику
for word in words:
  word_count[word] = word_count.get(word, 0) + 1

# Знаходить слово, яке зустрічається найчастіше та є найменше за лексикографічним порядком
most_common_word = min(max(word_count, key=word_count.get), min(word_count, key=word_count.get))

# Вивести слово, яке відповідає умові задачі
print(most_common_word)