
"""
Варіант 8

Задача №1: Реалізуйте алгоритм дешифрування (декодування) рядків, закодованих за допомогою одного з найпростіших варіантів кодування довжин послідовностей. На вхід алгоритму подається рядок, що містить цифри і символи англійського алфавіту. Цей рядок розбивається на так звані серії (послідовності), які кодуються парою число-символ або просто символ (в такому випадку число вважається рівним одиниці). Результат повинен містити ці серії в тому ж порядку, що вони і зустрічаються в заданому рядку, при цьому кожна серія розгортається в послідовність символів відповідної довжини
Автор: Гладкович Ярослав
"""

# Запит для користувача ввести закодований рядок
encoded_str = input("Введіть закодований рядок: ")

# Ініціалізація вихідного розкодованого рядка
decoded_str = ""

# Ініціалізація змінної для збереження кількості символів у поточній серії
count_str = ""

# Перебір символів у закодованому рядку
for char in encoded_str:
    # Якщо поточний символ - цифра, додаємо його до лічильника
    if char.isdigit():
        count_str += char
    # Якщо поточний символ - буква, розгортаємо серію і додаємо символи до розкодованого рядка
    else:
        if count_str:
            decoded_str += int(count_str) * char
            count_str = ""
        else:
            decoded_str += char
  
# Виведення розкодованого рядка
print(decoded_str)